# Lesson 1: Introduction to Databases & SQLite Setup

**Duration:** 20 minutes  
**Learning Mode:** Read each section, then run the code cells as you progress

---

## üéØ Learning Objectives

By the end of this lesson, you will be able to:
- Understand what databases are and why we use them
- Create your first SQLite database
- Design and create a table with appropriate data types
- Insert data into a table
- Use primary keys to uniquely identify records

## üìö What is a Database?

A **database** is an organised collection of data that can be easily accessed, managed, and updated. Think of it like a digital filing cabinet where information is stored in a structured way.

### Why Use Databases?

- **Organisation:** Keep related data together in a logical structure
- **Efficiency:** Quickly find and retrieve specific information
- **Consistency:** Ensure data follows specific rules and formats
- **Scalability:** Handle small or large amounts of data
- **Multi-user Access:** Multiple people can work with the same data

### Types of Databases

1. **Relational Databases** (what we're learning!)
   - Data stored in tables with rows and columns
   - Tables can be related to each other
   - Examples: SQLite, MySQL, PostgreSQL

2. **Non-Relational Databases** (NoSQL)
   - Data stored in documents, key-value pairs, or graphs
   - More flexible structure
   - Examples: MongoDB, Redis

### What is SQLite?

**SQLite** is a lightweight relational database that:
- Stores data in a single file (`.db`)
- Doesn't require a separate server
- Is perfect for learning and small-to-medium applications
- Is used in mobile apps, browsers, and embedded systems

## üõ†Ô∏è Setup: Connect to Database

First, we need to install and load the SQL magic extension that lets us run SQL in Jupyter notebooks.

**Run the next 2 cells to set up your environment:**

In [1]:
# Load SQL magic extension
%load_ext sql

# Fix prettytable compatibility issue
import prettytable
try:
    # Try to access DEFAULT to see if it exists
    _ = prettytable.DEFAULT
except AttributeError:
    # If it doesn't exist, add it using SINGLE_BORDER
    from prettytable import SINGLE_BORDER
    prettytable.DEFAULT = SINGLE_BORDER

# Configure SQL magic settings
%config SqlMagic.autopandas = False
%config SqlMagic.displaycon = False
%config SqlMagic.feedback = False

/tmp/ipykernel_4311/3162060372.py:8: DeprecationWarning: the 'DEFAULT' constant is deprecated, use the 'TableStyle' enum instead
  _ = prettytable.DEFAULT

In [2]:
# Connect to SQLite database (creates starwars.db if it doesn't exist)
%sql sqlite:///starwars.db

## üèóÔ∏è Part 1: Creating Your First Table

### Understanding Tables

A **table** is like a spreadsheet with:
- **Columns:** Define what type of information is stored (like "Name" or "Age")
- **Rows:** Individual records (like one person's information)

### The Characters Table

We'll create a table to store Star Wars characters with these columns:

| Column Name | Data Type | Purpose |
|-------------|-----------|---------|
| `id` | INTEGER | Unique identifier for each character |
| `name` | TEXT | Character's name |
| `species` | TEXT | What species they are |
| `homeworld` | TEXT | Their home planet |

### üîç Understanding the CREATE TABLE Code

Let's break down what each part does:

- `CREATE TABLE` - Command to create a new table
- `IF NOT EXISTS` - Only create if table doesn't already exist (prevents errors)
- `characters` - Name of our table
- `id INTEGER PRIMARY KEY AUTOINCREMENT` - Creates an auto-numbering ID column
  - `INTEGER` - Number data type
  - `PRIMARY KEY` - Uniquely identifies each row
  - `AUTOINCREMENT` - Automatically assigns the next number
- `name TEXT NOT NULL` - Text column that must have a value
  - `TEXT` - Text data type
  - `NOT NULL` - This field cannot be empty
- `species TEXT` - Text column (optional)
- `homeworld TEXT` - Text column (optional)

**Run the cell below to create your table:**

In [3]:
%%sql
-- Create the characters table
CREATE TABLE IF NOT EXISTS characters (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    species TEXT,
    homeworld TEXT
);

[]

‚úÖ **Success!** Your table has been created. Let's verify it exists by viewing its structure:

In [4]:
%%sql
-- View the structure of the characters table
PRAGMA table_info(characters);

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 1, None, 0),
 (2, 'species', 'TEXT', 0, None, 0),
 (3, 'homeworld', 'TEXT', 0, None, 0)]

## üìù Part 2: Inserting Data

### The INSERT Statement

Now let's add characters to our table! The `INSERT INTO` statement adds new rows.

### üîç Understanding the INSERT Statement

- `INSERT INTO characters` - Which table to insert into
- `(name, species, homeworld)` - Which columns we're filling (id is automatic!)
- `VALUES` - Keyword before the data
- `('Luke Skywalker', 'Human', 'Tatooine')` - One row of data
- Note: Text values are in **single quotes** `'like this'`
- Multiple rows separated by commas

**Run the cell below to insert 8 Star Wars characters:**

In [5]:
%%sql
-- Insert Star Wars characters
INSERT INTO characters (name, species, homeworld) VALUES
    ('Luke Skywalker', 'Human', 'Tatooine'),
    ('Leia Organa', 'Human', 'Alderaan'),
    ('Han Solo', 'Human', 'Corellia'),
    ('Chewbacca', 'Wookiee', 'Kashyyyk'),
    ('Obi-Wan Kenobi', 'Human', 'Stewjon'),
    ('Darth Vader', 'Human', 'Tatooine'),
    ('Yoda', 'Yoda''s species', 'Unknown'),
    ('R2-D2', 'Droid', 'Naboo');

[]

### Verify Your Data

Let's check that the data was inserted correctly using a `SELECT` statement.

**`SELECT * FROM characters`** means "select all columns from the characters table"

**Run the cell below:**

In [6]:
%%sql
-- View all characters
SELECT * FROM characters;

[(1, 'Luke Skywalker', 'Human', 'Tatooine'),
 (2, 'Leia Organa', 'Human', 'Alderaan'),
 (3, 'Han Solo', 'Human', 'Corellia'),
 (4, 'Chewbacca', 'Wookiee', 'Kashyyyk'),
 (5, 'Obi-Wan Kenobi', 'Human', 'Stewjon'),
 (6, 'Darth Vader', 'Human', 'Tatooine'),
 (7, 'Yoda', "Yoda's species", 'Unknown'),
 (8, 'R2-D2', 'Droid', 'Naboo')]

üéâ **Excellent!** You should see a table with 8 characters, each with an automatically assigned ID.

## üéì Practice Exercise: Add More Characters

Now it's your turn! We'll add **3 more characters** to the database.

**Characters to add:**
- Padm√© Amidala (Human, Naboo)
- Mace Windu (Human, Haruun Kal)
- Ahsoka Tano (Togruta, Shili)

**Run the cell below:**

In [7]:
%%sql
-- Practice Exercise: Add 3 more characters
INSERT INTO characters (name, species, homeworld) VALUES
    ('Padm√© Amidala', 'Human', 'Naboo'),
    ('Mace Windu', 'Human', 'Haruun Kal'),
    ('Ahsoka Tano', 'Togruta', 'Shili');

[]

### Verify All Characters

Let's view all characters again to see our additions:

In [8]:
%%sql
SELECT * FROM characters;

[(1, 'Luke Skywalker', 'Human', 'Tatooine'),
 (2, 'Leia Organa', 'Human', 'Alderaan'),
 (3, 'Han Solo', 'Human', 'Corellia'),
 (4, 'Chewbacca', 'Wookiee', 'Kashyyyk'),
 (5, 'Obi-Wan Kenobi', 'Human', 'Stewjon'),
 (6, 'Darth Vader', 'Human', 'Tatooine'),
 (7, 'Yoda', "Yoda's species", 'Unknown'),
 (8, 'R2-D2', 'Droid', 'Naboo'),
 (9, 'Padm√© Amidala', 'Human', 'Naboo'),
 (10, 'Mace Windu', 'Human', 'Haruun Kal'),
 (11, 'Ahsoka Tano', 'Togruta', 'Shili')]

‚úÖ You should now see **11 characters** total!

## üéØ Challenge Problem: Create a Droids Table

**Task:** Create a second table called `droids` with these columns:
- `id` (INTEGER, PRIMARY KEY, AUTOINCREMENT)
- `name` (TEXT, NOT NULL)
- `model` (TEXT)
- `primary_function` (TEXT)
- `manufacturer` (TEXT)

Then insert at least 4 droids with their information.

**Run the cells below to complete the challenge:**

In [9]:
%%sql
-- Challenge: Create droids table
CREATE TABLE IF NOT EXISTS droids (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    model TEXT,
    primary_function TEXT,
    manufacturer TEXT
);

[]

In [10]:
%%sql
-- Insert droid data
INSERT INTO droids (name, model, primary_function, manufacturer) VALUES
    ('R2-D2', 'R2-series astromech', 'Astromech', 'Industrial Automaton'),
    ('C-3PO', '3PO-series protocol', 'Protocol and translation', 'Cybot Galactica'),
    ('BB-8', 'BB-series astromech', 'Astromech', 'Industrial Automaton'),
    ('K-2SO', 'KX-series security', 'Security and enforcement', 'Arakyd Industries');

[]

### Verify the Droids Table

In [11]:
%%sql
SELECT * FROM droids;

[(1, 'R2-D2', 'R2-series astromech', 'Astromech', 'Industrial Automaton'),
 (2, 'C-3PO', '3PO-series protocol', 'Protocol and translation', 'Cybot Galactica'),
 (3, 'BB-8', 'BB-series astromech', 'Astromech', 'Industrial Automaton'),
 (4, 'K-2SO', 'KX-series security', 'Security and enforcement', 'Arakyd Industries')]

### View Droids Table Structure

In [12]:
%%sql
PRAGMA table_info(droids);

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 1, None, 0),
 (2, 'model', 'TEXT', 0, None, 0),
 (3, 'primary_function', 'TEXT', 0, None, 0),
 (4, 'manufacturer', 'TEXT', 0, None, 0)]

## üìä Bonus: Count Records in Each Table

Let's use a more advanced query to see how many records are in each table:

In [13]:
%%sql
SELECT 'characters' AS table_name, COUNT(*) AS record_count FROM characters
UNION ALL
SELECT 'droids' AS table_name, COUNT(*) AS record_count FROM droids;

[('characters', 11), ('droids', 4)]

üí° **Pro Tip:** You don't need to know Star Wars! Just use these queries to explore the data when you're writing your own queries. This is how real database work is done - exploring unfamiliar data!

üìå **Bookmark this section** - Every lesson has similar reference cells at the top to help you!

In [14]:
%%sql
-- How many characters total?
SELECT COUNT(*) as total_characters FROM characters;

[(11,)]

### Count Records

In [15]:
%%sql
-- See just 5 examples
SELECT * FROM characters LIMIT 5;

[(1, 'Luke Skywalker', 'Human', 'Tatooine'),
 (2, 'Leia Organa', 'Human', 'Alderaan'),
 (3, 'Han Solo', 'Human', 'Corellia'),
 (4, 'Chewbacca', 'Wookiee', 'Kashyyyk'),
 (5, 'Obi-Wan Kenobi', 'Human', 'Stewjon')]

### Quick Preview

In [16]:
%%sql
-- See unique planets
SELECT DISTINCT homeworld FROM characters;

[('Tatooine',),
 ('Alderaan',),
 ('Corellia',),
 ('Kashyyyk',),
 ('Stewjon',),
 ('Unknown',),
 ('Naboo',),
 ('Haruun Kal',),
 ('Shili',)]

### See Homeworld Planets

In [17]:
%%sql
-- See unique species types
SELECT DISTINCT species FROM characters;

[('Human',), ('Wookiee',), ("Yoda's species",), ('Droid',), ('Togruta',)]

### Discover What Species Exist

In [18]:
%%sql
-- Run this to see ALL characters (names, species, planets, heights)
SELECT * FROM characters;

[(1, 'Luke Skywalker', 'Human', 'Tatooine'),
 (2, 'Leia Organa', 'Human', 'Alderaan'),
 (3, 'Han Solo', 'Human', 'Corellia'),
 (4, 'Chewbacca', 'Wookiee', 'Kashyyyk'),
 (5, 'Obi-Wan Kenobi', 'Human', 'Stewjon'),
 (6, 'Darth Vader', 'Human', 'Tatooine'),
 (7, 'Yoda', "Yoda's species", 'Unknown'),
 (8, 'R2-D2', 'Droid', 'Naboo'),
 (9, 'Padm√© Amidala', 'Human', 'Naboo'),
 (10, 'Mace Windu', 'Human', 'Haruun Kal'),
 (11, 'Ahsoka Tano', 'Togruta', 'Shili')]

---

## üîç Data Explorer - Use This Anytime!

**Don't know what data is in the database?** No problem! Use these queries anytime you're stuck:

### See All Available Data

## ‚úÖ Checkpoint: What You've Learnt

Before moving on, make sure you can:

- ‚úÖ Explain what a database is and why it's useful
- ‚úÖ Create a table with appropriate columns and data types
- ‚úÖ Understand what a PRIMARY KEY is
- ‚úÖ Insert single and multiple rows of data
- ‚úÖ Use SELECT to view your data
- ‚úÖ Write comments in SQL using `--`

## üìñ Key SQL Commands Learnt

| Command | Purpose | Example |
|---------|---------|---------|
| `CREATE TABLE` | Create a new table | `CREATE TABLE characters (...)` |
| `INSERT INTO` | Add new rows to a table | `INSERT INTO characters VALUES (...)` |
| `SELECT` | Retrieve data from a table | `SELECT * FROM characters;` |
| `PRIMARY KEY` | Uniquely identify each row | `id INTEGER PRIMARY KEY` |
| `NOT NULL` | Column must have a value | `name TEXT NOT NULL` |

## üéâ Well Done!

You've created your first database and table! In the next lesson, you'll learn how to query this data using SELECT statements with filtering conditions.

**Ready to continue?** Open `lesson2_queries.ipynb`

---

## üíæ Git Commands (for reference)

When you're ready to save your work:

```bash
git status
git add lessons/lesson1_setup.ipynb
git commit -m "Completed Lesson 1: Created characters table and inserted data"
git push
```